[
    {
        "key": 1,
        "jobTitle": "Front End Web Developer, R&D design team.",
        "jobDates": "<em>Plus500 <small>(2018 - present day)</small></em>",
        "jobDescription": "<p>Working with a team of designers / developers that are responsible for Plus500's products: main website, affiliates website, web trader, Native applications (iOS, Android), Email design implementation (Email client compatability) & inner applications that are used by several teams.</p><p>I've helped maintaining an email builder interface that is used by content team used to build Emails & export the markup into localization.<br>I was also in charge of <a href=\"https://www.plus500.co.uk\" target=\"_blank\" rel=\"noreferrer\">Plus500 website</a> (regulated, multilingual, dark theme supported, accessible). Covered both frontend & backend (CSHTML, SCSS, .NET C#) in an MVC paradigm, by doing so saved time & resources of other teams<p><p>Learned how to managem NPM packages & NodeJS, implemented Gulp task runner script which took care of SASS (compilation), JS (minification & bundling).</p><p>Perfected website load time using Lighthouse auditing tool: font load delivery, images lazy load optimization of styles (with component driven design).</p><p>Worked with Bootstrap 3-5 & Zurb's Foundation CSS frameworks.</p><p>Built Chrome extensions that helped me complete tedious tasks and saved me precious time.</p>"
    },
    {
        "key": 2,
        "jobTitle": "Full-Stack Web Developer",
        "jobDates": "<em>Marvilix, development team. <small>(2016 - 2017)</small></em>",
        "jobDescription": "<p>I've been in charge of WordPress websites (installations, maintenance, optimization, customization to both frontend & backend), Lead the development of an interactive accessibility tool for people with disabilities. Helped with building of web applications & worked with various API's, took part in creating ERP interfaces. Optimized websites with the recommendations of google PAGE INSIGHTS (such as: caching, minification, content delivery).</p><p>Learned AngularJS, gained more PHP & MYSQL experience. Started working with GIT & AWS services (EC2, S3).</p>"
    },
    {
        "key": 3,
        "jobTitle": "Front End Developer",
        "jobDates": "<em>Microline systems, web developers team. <small>(2014 - 2016)</small></em>",
        "jobDescription": "<p>Created a unique accessibility tool for the company which covered 65% of WCGA AA requirements. I was in charge of website innovation, required research on my part in UX \/ UI. Helped implementing methods for Google Analytics Events, later on with Google's Tag Manager. Implemented several jQuery galleries & plugins, also wrote some of my own.\r\n Customized the \"Bsmart\" application backend system for the client needs.<\/p><p>Learned working with Bootstrap, perfected JavaScript & jQuery Skills. Mainly worked with XSLT, HTML5, ASP, CSS, JavaScript & jQuery.<\/p>"
    },
    {
        "key": 4,
        "jobTitle": "Webmaster",
        "jobDates": "<em>Studio-Sparkle, Web design. <small>(2008 - 2014)</small></em>",
        "jobDescription": "<p>Installation, maintenance & customization of Drupal, Joomla & WordPress websites. Worked with Cpanel, Control Web Panel (opensource web panel), Plesk & DirectAdmin.</p><p>Creation of landing pages.</p>"
    },
    {
        "key": 5,
        "jobTitle": "Web designer",
        "jobDates": "<em>Freelance. <small>(2010 - 2013)</small></em>",
        "jobDescription": "<p>Worked as a freelance web developer, mainly created static HTML / CSS websites & landing pages.</p>"
    }
]